In [36]:
import pandas as pd
import numpy as np

In [37]:
df1=pd.DataFrame({'Students':['Jim','Jason','Mike','Mary','Jack'],'Batch':['CSE','ECE','ISE','TCE','EEE']})
df1

  Students Batch
0      Jim   CSE
1    Jason   ECE
2     Mike   ISE
3     Mary   TCE
4     Jack   EEE

In [38]:
df2=pd.DataFrame({'Employees':['Rose','Lily','Jasmin','Peter','Max'],'Emp_Id':[10,20,30,40,50]})
df2

  Employees  Emp_Id
0      Rose      10
1      Lily      20
2    Jasmin      30
3     Peter      40
4       Max      50